In [82]:
import pandas as pd
import requests
from census import Census


from config import (api_key)
c = Census(api_key, year=2013)

In [83]:

census_data = c.acs5.get(("NAME", "B01003_001E"), {'for': 'metropolitan statistical area/micropolitan statistical area:*'})

census_pd = pd.DataFrame(census_data)


census_pd = census_pd.rename(columns={"B01003_001E": "Population",
                                      "NAME": "Name", "metropolitan statistical area/micropolitan statistical area": "MSA"})

In [84]:
ari = census_pd[census_pd['MSA'].str.match('38060')]
sd = census_pd[census_pd['MSA'].str.match('41740')]
mia = census_pd[census_pd['MSA'].str.match('33100')]
tb = census_pd[census_pd['MSA'].str.match('45300')]
nym = census_pd[census_pd['MSA'].str.match('35620')]
nyy = census_pd[census_pd['MSA'].str.match('35620')]
mil = census_pd[census_pd['MSA'].str.match('33340')]
kc = census_pd[census_pd['MSA'].str.match('28140')]
cle = census_pd[census_pd['MSA'].str.match('17460')]
cin = census_pd[census_pd['MSA'].str.match('17140')]
pit = census_pd[census_pd['MSA'].str.match('38300')]
col = census_pd[census_pd['MSA'].str.match('19740')]
bal = census_pd[census_pd['MSA'].str.match('12580')]
minn = census_pd[census_pd['MSA'].str.match('33460')]
sea = census_pd[census_pd['MSA'].str.match('42660')]
sf = census_pd[census_pd['MSA'].str.match('41860')]
oak = census_pd[census_pd['MSA'].str.match('41860')]
det = census_pd[census_pd['MSA'].str.match('19820')]
bos = census_pd[census_pd['MSA'].str.match('71650')]
atl = census_pd[census_pd['MSA'].str.match('12060')]
wsh = census_pd[census_pd['MSA'].str.match('47900')]
hou = census_pd[census_pd['MSA'].str.match('26420')]
phi = census_pd[census_pd['MSA'].str.match('37980')]
tex = census_pd[census_pd['MSA'].str.match('19100')]
chc = census_pd[census_pd['MSA'].str.match('16980')]
cws = census_pd[census_pd['MSA'].str.match('16980')]
laa = census_pd[census_pd['MSA'].str.match('31100')]
lad = census_pd[census_pd['MSA'].str.match('31100')]
stl = census_pd[census_pd['MSA'].str.match('41180')]

In [128]:
wsh

                                                  Name  Population    MSA
618  Washington-Arlington-Alexandria, DC-VA-MD-WV M...   5759330.0  47900

In [97]:
bos

Empty DataFrame
Columns: [Name, Population, MSA]
Index: []

In [94]:
sf

                                             Name  Population    MSA
479  San Francisco-Oakland-Hayward, CA Metro Area   4402729.0  41860

In [95]:
col

                                      Name  Population    MSA
364  Denver-Aurora-Lakewood, CO Metro Area   2601465.0  19740

In [96]:
stl

                            Name  Population    MSA
465  St. Louis, MO-IL Metro Area   2792127.0  41180

In [99]:
ari

                                       Name  Population    MSA
391  Phoenix-Mesa-Scottsdale, AZ Metro Area   4268289.0  38060

In [100]:
atl

                                             Name  Population    MSA
185  Atlanta-Sandy Springs-Roswell, GA Metro Area   5379176.0  12060

In [101]:
bal

                                         Name  Population    MSA
196  Baltimore-Columbia-Towson, MD Metro Area   2734044.0  12580

In [102]:
bos

Empty DataFrame
Columns: [Name, Population, MSA]
Index: []

In [103]:
chc

                                              Name  Population    MSA
298  Chicago-Naperville-Elgin, IL-IN-WI Metro Area   9488493.0  16980

In [104]:
cin

                                Name  Population    MSA
301  Cincinnati, OH-KY-IN Metro Area   2122940.0  17140

In [105]:
cle

                                Name  Population    MSA
309  Cleveland-Elyria, OH Metro Area   2070965.0  17460

In [112]:
mia

                                                  Name  Population    MSA
819  Miami-Fort Lauderdale-West Palm Beach, FL Metr...   5673185.0  33100

In [118]:
phi

                                                  Name  Population    MSA
390  Philadelphia-Camden-Wilmington, PA-NJ-DE-MD Me...   5992766.0  37980

In [123]:
tam

NameError: name 'tam' is not defined

In [110]:
laa

Empty DataFrame
Columns: [Name, Population, MSA]
Index: []

In [126]:
tor

NameError: name 'tor' is not defined